In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10, 'b':20, 'c':30}

In [4]:
d

{'a': 10, 'b': 20, 'c': 30}

In [5]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(data= my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [9]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(data = labels)

0    a
1    b
2    c
dtype: object

In [12]:
pd.Series(data=[sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [13]:
ser1 = pd.Series([1,2,3,4],['USA', 'Germany', 'USSR', 'Japan'])

In [14]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [15]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [24]:
ser1['USA']

1

In [21]:
ser3 = pd.Series(data = labels)
ser3

0    a
1    b
2    c
dtype: object

In [22]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [23]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [25]:
ser1+ ser2 #(autimatucally convert integer to float)

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# DATAFRAMEEEEE !

In [2]:
import numpy as np
import pandas as pd

In [3]:
from numpy.random import randn

In [4]:
np.random.seed(101)

In [5]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])

In [6]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [7]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [8]:
type(df['W'])

pandas.core.series.Series

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [13]:
df['new'] = df['W'] + df['Z']

In [14]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [16]:
df.drop('new', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [18]:
df.drop('new',axis=1,inplace=True)

In [19]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [21]:
df.shape

(5, 4)

In [22]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
#row
df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [26]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [27]:
df.loc['B','Y']

-0.8480769834036315

In [28]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

# Practice

In [2]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [94]:
indexs = 'A B C D E F G H I J'.split()
cols = 'O P Q R S T'.split()
df = pd.DataFrame(randn(10,6),indexs,cols)

In [96]:
df

          O         P         Q         R         S         T
A -1.080490 -0.162702  1.820310 -0.682101 -0.105617 -0.816274
B  1.582108  1.852704  0.421809 -1.929586  1.400822  1.403181
C  1.281013 -2.071028 -0.577854  0.515019 -1.002856  0.710052
D -0.483845 -0.226272 -0.727387 -0.266590  0.266164 -0.795485
E  0.738849  0.953101 -0.705434  0.354908  1.762157  1.416078
F -0.259672  0.537772 -0.855940 -1.968509 -0.034611 -0.926588
G -0.253143  1.543770 -1.266536  1.626744 -0.235404  1.487045
H  0.486675 -1.141157  0.212739 -0.998161  0.886320  0.508006
I  0.842754 -0.176570  1.066886 -0.875606  1.515032 -0.200651
J -0.881466 -1.263844 -0.786618  0.973644  1.093434 -0.807600

In [97]:
df.loc['J']

O   -0.881466
P   -1.263844
Q   -0.786618
R    0.973644
S    1.093434
T   -0.807600
Name: J, dtype: float64

In [100]:
df[['Q','T','O']]

          Q         T         O
A  1.820310 -0.816274 -1.080490
B  0.421809  1.403181  1.582108
C -0.577854  0.710052  1.281013
D -0.727387 -0.795485 -0.483845
E -0.705434  1.416078  0.738849
F -0.855940 -0.926588 -0.259672
G -1.266536  1.487045 -0.253143
H  0.212739  0.508006  0.486675
I  1.066886 -0.200651  0.842754
J -0.786618 -0.807600 -0.881466

In [101]:
df['Q']>0

A     True
B     True
C    False
D    False
E    False
F    False
G    False
H     True
I     True
J    False
Name: Q, dtype: bool

In [102]:
df['T']<0

A     True
B    False
C    False
D     True
E    False
F     True
G    False
H    False
I     True
J     True
Name: T, dtype: bool

In [103]:
df[['Q','T']]

          Q         T
A  1.820310 -0.816274
B  0.421809  1.403181
C -0.577854  0.710052
D -0.727387 -0.795485
E -0.705434  1.416078
F -0.855940 -0.926588
G -1.266536  1.487045
H  0.212739  0.508006
I  1.066886 -0.200651
J -0.786618 -0.807600

In [104]:
df[(df['Q']>0) & (df['T']<0)]

          O         P         Q         R         S         T
A -1.080490 -0.162702  1.820310 -0.682101 -0.105617 -0.816274
I  0.842754 -0.176570  1.066886 -0.875606  1.515032 -0.200651

In [105]:
df

          O         P         Q         R         S         T
A -1.080490 -0.162702  1.820310 -0.682101 -0.105617 -0.816274
B  1.582108  1.852704  0.421809 -1.929586  1.400822  1.403181
C  1.281013 -2.071028 -0.577854  0.515019 -1.002856  0.710052
D -0.483845 -0.226272 -0.727387 -0.266590  0.266164 -0.795485
E  0.738849  0.953101 -0.705434  0.354908  1.762157  1.416078
F -0.259672  0.537772 -0.855940 -1.968509 -0.034611 -0.926588
G -0.253143  1.543770 -1.266536  1.626744 -0.235404  1.487045
H  0.486675 -1.141157  0.212739 -0.998161  0.886320  0.508006
I  0.842754 -0.176570  1.066886 -0.875606  1.515032 -0.200651
J -0.881466 -1.263844 -0.786618  0.973644  1.093434 -0.807600

In [106]:
df.drop(index=['B','C','D'],columns=['P','R'])

          O         Q         S         T
A -1.080490  1.820310 -0.105617 -0.816274
E  0.738849 -0.705434  1.762157  1.416078
F -0.259672 -0.855940 -0.034611 -0.926588
G -0.253143 -1.266536 -0.235404  1.487045
H  0.486675  0.212739  0.886320  0.508006
I  0.842754  1.066886  1.515032 -0.200651
J -0.881466 -0.786618  1.093434 -0.807600

In [152]:
df_drop = df.drop(index=['B','C','D'],columns=['P','R'])['O']
df_drop[df_drop<0].loc[['F','G']]

F   -0.259672
G   -0.253143
Name: O, dtype: float64

In [113]:
df_drop2 = df.drop(index=['B','C','D'],columns=['P','R'])
df_drop2

          O         Q         S         T
A -1.080490  1.820310 -0.105617 -0.816274
E  0.738849 -0.705434  1.762157  1.416078
F -0.259672 -0.855940 -0.034611 -0.926588
G -0.253143 -1.266536 -0.235404  1.487045
H  0.486675  0.212739  0.886320  0.508006
I  0.842754  1.066886  1.515032 -0.200651
J -0.881466 -0.786618  1.093434 -0.807600

In [143]:
df_drop2['MEAN'] = np.nan
df_drop2

          O         Q         S         T  MEAN
A -1.080490  1.820310 -0.105617 -0.816274   NaN
E  0.738849 -0.705434  1.762157  1.416078   NaN
F -0.259672 -0.855940 -0.034611 -0.926588   NaN
G -0.253143 -1.266536 -0.235404  1.487045   NaN
H  0.486675  0.212739  0.886320  0.508006   NaN
I  0.842754  1.066886  1.515032 -0.200651   NaN
J -0.881466 -0.786618  1.093434 -0.807600   NaN

In [146]:
df_drop2.loc['A']

O      -1.080490
Q       1.820310
S      -0.105617
T      -0.816274
MEAN   -0.045518
Name: A, dtype: float64

In [145]:
for i in range(0,7):
    a = df_drop2.iloc[i].mean()
    df_drop2.iloc[i].fillna(value=a,inplace=True)
df_drop2

          O         Q         S         T      MEAN
A -1.080490  1.820310 -0.105617 -0.816274 -0.045518
E  0.738849 -0.705434  1.762157  1.416078  0.802913
F -0.259672 -0.855940 -0.034611 -0.926588 -0.519203
G -0.253143 -1.266536 -0.235404  1.487045 -0.067009
H  0.486675  0.212739  0.886320  0.508006  0.523435
I  0.842754  1.066886  1.515032 -0.200651  0.806005
J -0.881466 -0.786618  1.093434 -0.807600 -0.345562

In [155]:
df_drop2.loc[['A','E','H'],['MEAN']]

       MEAN
A -0.045518
E  0.802913
H  0.523435

In [156]:
df_drop2.reset_index()

  index         O         Q         S         T      MEAN
0     A -1.080490  1.820310 -0.105617 -0.816274 -0.045518
1     E  0.738849 -0.705434  1.762157  1.416078  0.802913
2     F -0.259672 -0.855940 -0.034611 -0.926588 -0.519203
3     G -0.253143 -1.266536 -0.235404  1.487045 -0.067009
4     H  0.486675  0.212739  0.886320  0.508006  0.523435
5     I  0.842754  1.066886  1.515032 -0.200651  0.806005
6     J -0.881466 -0.786618  1.093434 -0.807600 -0.345562

In [178]:
name_cols = {'O':'MATH','Q':'SCIENCE','S':'SOCIAL','T':'ART','MEAN':'MEAN'}
df_drop2.rename(columns = name_cols,inplace=True)

In [180]:
name_indexs = 'STU1 STU2 STU3 STU4 STU5 STU6 STU7'.split()
df_drop2['NEW'] = name_indexs
df_drop2

       MATH   SCIENCE    SOCIAL       ART      MEAN   NEW
A -1.080490  1.820310 -0.105617 -0.816274 -0.045518  STU1
E  0.738849 -0.705434  1.762157  1.416078  0.802913  STU2
F -0.259672 -0.855940 -0.034611 -0.926588 -0.519203  STU3
G -0.253143 -1.266536 -0.235404  1.487045 -0.067009  STU4
H  0.486675  0.212739  0.886320  0.508006  0.523435  STU5
I  0.842754  1.066886  1.515032 -0.200651  0.806005  STU6
J -0.881466 -0.786618  1.093434 -0.807600 -0.345562  STU7

In [182]:
df_drop2 = df_drop2.set_index('NEW')

In [183]:
df_drop2

          MATH   SCIENCE    SOCIAL       ART      MEAN
NEW
STU1 -1.080490  1.820310 -0.105617 -0.816274 -0.045518
STU2  0.738849 -0.705434  1.762157  1.416078  0.802913
STU3 -0.259672 -0.855940 -0.034611 -0.926588 -0.519203
STU4 -0.253143 -1.266536 -0.235404  1.487045 -0.067009
STU5  0.486675  0.212739  0.886320  0.508006  0.523435
STU6  0.842754  1.066886  1.515032 -0.200651  0.806005
STU7 -0.881466 -0.786618  1.093434 -0.807600 -0.345562